{
    "why_buy": "Why Buy Puzzle and Intelligence Games ?",
    "why_buy_desc": "In a time where everything is becoming digital and virtual, it’s very important that our children have things that develop their minds, make them think smartly, and enjoy at the same time. That’s why we offer a unique collection of puzzles and intelligence games that help stimulate the brain, strengthen thinking skills, and enhance creativity in both children and even adults!",
    "how_puzzles_make_smarter": "How Do Puzzle Games Make Kids Smarter?",
    "cognitive_impact": "Understanding the impact on cognitive development",
    "problem_solving": "Problem Solving",
    "problem_solving_desc": "When a child faces a puzzle, they start thinking logically to solve the problem",
    "strengthens_memory": "Strengthens Memory and Focus",
    "memory_focus_desc": "Some puzzles require remembering details or certain steps, which helps in boosting memory",
    "develops_social_skills": "Develops Social Skills",
    "social_skills_desc": "Some games require teamwork, teaching children how to interact and cooperate with others",
    "encourages_creativity": "Encourages Creativity",
    "creativity_desc": "Some puzzles require thinking outside the box and finding non-traditional solutions",
    "whats_special": "What’s Special About Our Games?",
    "whats_special_desc": "Experience excellence in every purchase",
    "high_quality": "High Quality",
    "high_quality_desc": "Durable and well-made games that are safe for children, ensuring they last with you for a long time",
    "fast_delivery": "Fast Delivery and Excellent Support",
    "fast_delivery_desc": "Your order will reach you quickly, and if you face any issues, we’re always here to help",
    "exceptional_support": "Exceptional Customer Support",
    "exceptional_support_desc": "We prioritize your satisfaction with fast responses, helpful assistance, and a smooth shopping experience",
    "suitable_for_all_ages": "Suitable for All Ages",
    "suitable_for_all_ages_desc": "We have games that both kids and adults will love"
  }
  